Repository: loginom/loginom-help-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: При изменении способа Аутентификации пользователя с "LDAP" на "Локальная" происходит сбрасывание пароля и следовательно пользователь может авторизоваться с пустым паролем, если при смене способа Аутентификации не был задан иной пароль.
en: When changing the Authentification user method from "LDAP" to "Local", the password is reset. Consequently, the user can log in with empty password if another password is not set when changing the Authentification method.

source: При изменений настроек узла Инспектор свойств обновляет дерево свойств.
en: When changing the node settings, the Property inspector updates the properties tree.

source: При импорте файла, содержащего символ одиночного знака вопроса ?, этот символ будет интерпретирован как <null> (пропущенное значение).
en: When importing the file that contains single inquiry character ?, this character will be interpreted as <null> (null value).

source: При использовании версии 8.0 не рекомендуется использовать новый метод аутентификации.
en: It is recommended to use the new authentification method if version 8.0 is used.

source: При использовании данной конструкции в запросе учитывается тип данных передаваемой переменной, он должен соответствовать типу данных, ожидаемых запросом 1С.
en: When using such construction, data type of the transferred variable is considered in the request. It must comply with the data type anticipated by 1C request.

source: При использовании данной функции необходимо в окне "Параметры выражения" установить флаг "Кэшировать рассчитанные значения выражения".
en: When using this function, it is required to select "Cache the calculated expression values" checkbox in the "Expression parameters" window.

source: При использовании относительных путей в корневом модуле (скрипте, который содержит редактор кода узла):
en: When using relative paths in the root modules (the script that contains the node code editor):

source: При использовании сторонних библиотек возможно переопределение значений по умолчанию параметров Режим синхронизации и Режим журнала транзакций.
en: When third-party libraries are used, it is possible to refefine values of Sync mode and Transaction journal mode parameters by default.

source: При их нажатии пересчитываются параметры квантования (количество интервалов, минимум, максимум) в зависимости от изменения методов и/или настроек параметров.
en: Their pressing enables to recalculate binning parameters (count of bins, minimum, maximum) taking into account changed methods and/or configuration of parameters.

source: При каждой итерации считывается весь обучающий набор данных и изменяются веса Нейросети.
en: The whole training data set is read for each iteration, and the Neural Network weights are changed.

source: При каждой итерации считывается весь обучающий набор данных и изменяются веса нейросети.
en: The whole training data set is read for each iteration, and the neural network weights are changed.

source: При клике мышкой на узле отобразятся иконки возможных действий.
en: Icons of possible actions will be displayed after mouse click.

source: При клике на колонку сортировка циклически меняется между следующими типами:
en: When clicking on the column, the sorting is cyclically switched between the following types:

source: При клике по свободной области файлового менеджера вызывает контекстное меню, в котором содержатся функции Загрузить, Создать каталог, Вставить и Обновить список.
en: It is possible to call the context menu by clicking on the free area of the file manager. It includes the following functions: Load, Create directory, Paste and Update list.

source: При левом соединении (SQL-аналог: LEFT JOIN, левой таблицей является главная таблица) главная и присоединяемая таблицы связываются по ключевым полям.
en: When the join is left (SQL analogue: LEFT JOIN, the main table is left), the main and joined tables are joined by the key fields.

source: При любом соединении (JOIN) в результирующий набор данных включаются ключевые поля только главной таблицы.
en: Only the key fields of the main table can be included into the resulting data set for any join (JOIN).

source: При наведении курсора к заголовку поля появится кнопка с дополнительными функциями.
en: When hovering cursor over the field caption, button with additional functions will appear.

source: При наведении курсора к заголовку поля появится кнопка с дополнительными функциями:
en: When the cursor is hovered over the field caption, button with the additional functions will appear:

source: При наведении курсора мыши на диаграмму в правом верхнем углу появляется кнопка , нажав на которую, диаграмма развернется на всю область визуализатора.
en: When hovering the mouse cursor over the chart in the right upper corner, button appears. Its pressing enables to expand the chart over the whole visualizer area.

source: При наведении курсора мыши на диаграмму в правом верхнем углу появляется кнопка , позволяющая развернуть диаграмму на всю область визуализатора.
en: When hovering the mouse cursor over the chart in the right upper corner, button appears. It enables to expand the chart over the whole visualizer area.

source: При наведении курсора мыши на столбец диаграммы всплывает окно (см.
en: When hovering mouse cursor over the chart column, the window appears (refer to.

source: При наведении курсора на показатель Гистограмма, отображается количество записей соответствующих данному интервалу или уникальному значению.
en: When hovering cursor over the Histogram indicator, the number of records matching this bin or unique value is displayed.

source: При наведении на столбец диаграммы появляется всплывающее окно, которое отображает значение поля и значение WoE/IV/Доли (см.
en: When hovering the mouse cursor over the chart column, the pop-up window appears. It displays the field value and WoE/IV/Rate value (refer to

source: При наведении на точку серии появляется подсказка со значением.
en: When hovering cursor over the series point, the tooltip with value appears.

source: При наведении указателя мыши на эту область выводится подсказка о количестве отображаемых полей.
en: When hovering cursor over this area, the tooltip with the number of the displayed fields is shown.

source: При нажатии на данный текст на экран выведется полная формулировка ошибки.
en: Full error text will be displayed, when this text pressing.

source: При нажатии на кнопку Добавить Добавить/Редактировать Редактировать появляется окно Добавить общую папку/Настройка общей папки.
en: When pressing Add Add/Edit Edit button, Add shared folder/Configure shared folder window appears.

source: При нажатии на кнопку Добавить Добавить/РедактироватьРедактировать появляется окно Новый пользователь/Редактирование пользователя, в этом окне настраиваются параметры пользователя.
en: When pressing Add Add/EditEdit button, New user/Edit user window appears. User parameters are configured in this window.

source: При нажатии на кнопку Предпросмотр активируются все входные порты, кроме непосредственно соединенных с текущим узлом Подключений.
en: When pressing Preview button, it is possible to activate all input ports, with the exception of the Connections connected with the current node.

source: При нажатии на кнопку происходит циклическая смена Индикаторов, также Индикатор можно переключить в выпадающем меню при нажатии на кнопку Раскрыть.
en: When pressing the button, the cyclic change of Indicators is performed, and also Indicator can be switched in the drop-down menu when pressing Open button.

source: При нажатии на кнопку происходит циклическая смена положений кластеров в таблице, также сменить положение кластеров в таблице можно в выпадающем меню при нажатии на кнопку Раскрыть.
en: When pressing the button, the cyclic change of cluster positions in the table is performed. And it is also possible to change cluster position in the table in the drop-down menu when pressing Open button.

source: При нажатии на кнопку происходит циклическая смена режимов масштабирования гистограмм, также режим можно переключить в выпадающем меню при нажатии на кнопку Раскрыть.
en: When pressing the button, the cyclic change of histogram scaling modes is performed. It is also possible to switch the mode in the drop-down menu when pressing Open button.

source: При нажатии на кнопку происходит циклическая смена способов Детализации, также способ Детализации можно переключить в выпадающем меню при нажатии на кнопку Раскрыть.
en: When pressing the button, the cyclic change of the Detailing methods is performed, and the Detailing method can be switched in the drop-down menu when pressing Open button.

source: При нажатии на название процесса в Сценарии будет найден и выделен узел, который отвечает за его выполнение.
en: When pressing the process name, the node required for its execution will be found and selected in the Workflow.

source: При нажатии на серию в легенде можно скрыть или показать ее на диаграмме.
en: When pressing the series in the legend, it is possible to hide or display it on the chart.

source: При нажатии правой кнопкой мыши на конкретную серию также появятся уже заданные для серии настройки и возможность их корректировки.
en: When pressing the given series with the right mouse button, the settings already set for the series and their adjustment options will also appear.

source: При наличии отображает все процессы, за исключением тех, которые были удалены пользователем;
en: If is available, it shows all processes, with the exception of those processes that have been removed by a user.

source: При настройке подключения задаются следующие параметры:
en: The following parameters are set during the connection setup:

source: При настройке подключения формируется список путей к файлам XSD-схем.
en: During the connection setup a list of paths to the XSD schemas files is made.

source: При настройке порта возможно задать их перечень и значения по умолчанию.
en: When configuring the port, it is required to set their list and values by default.

source: При настройке порта пользователь имеет возможность:
en: When configuring the port, a user has the following possibilities:

source: При настройке соответствия между столбцами порта можно выбрать варианты замены или добавления столбцов.
en: When configuring port columns mapping, it is possible to select columns replacement or addition options.

source: При настройке узла задается произвольное количество заголовков HTTP-запроса.
en: When configuring the node, the random number of HTTP request headers is set.

source: При настройке узла разгруппировки выберем метод С расчетом долей по всей выборке, выставим округление до одного знака после запятой и Пропорциональный метод балансировки.
en: When configuring the ungrouping node, let's select With calculation of quotas for total sample method, set rounding up to one decimal place and Proportional balance method.

source: При неактивном флаге столбцы накладываются друг на друга.
en: When the checkbox is inactive, the columns are overlapped.

source: При необходимости настроить несколько позиций одновременно, их можно выделить следующими способами:
en: If it is required to configure several positions simultaneously, they can be selected using the following methods:

source: При необходимости удаления всех связей используется кнопка Удалить все связи.
en: If all links are to be deleted, Delete all links button is used.

source: При необходимости, можно ввести путь вручную.
en: If required, it is possible to enter the path manually.

source: При необходимости, уже спроектированный Сценарий можно запустить в другой среде исполнения.
en: Where applicable, already designed Workflow can be launched in another execution environment.

source: При необходимости, через "" указывается именованный экземпляр SQL-сервера.
en: If it is necessary, the named instance of SQL server is specified using "".

source: При несоответствии типов выходной набор этого узла будет содержать сообщение об ошибке.
en: If the types are inconsistent, the output data set of this node will contain an error message.

source: При нулевом значении параметра разделение на транзакции не производится.
en: If the parameter value is null, division into transactions is not performed.

source: При отсутствии показывает только активные процессы и процессы, в которых возникли ошибки.
en: If there is no , it shows only active processes and the processes in which errors occurred.

source: При отсутствии данного флага извлечение документа, начинающегося, например, с объявления &lt;
en: When this checkbox is not available, extraction of the document that starts, for example, from such notice as &lt;

source: При отсутствии данного флага поле получит название ACCESS-LEVEL.
en: When this checkbox is not available, the field will get ACCESS-LEVEL name.

source: При отсутствии флага поле получит название "ACCESS-LEVEL".
en: When there is no such checkbox, the field will get the following name: "ACCESS-LEVEL".

source: При пакетном выполнении Сценариев для каждого из узлов можно задать следующие варианты выполнения:
en: The following execution options can be set for each of the nodes in the case of the Workflows batch processing:

source: При первом нажатии на поле выполняется сортировка по возрастанию , при втором — по убыванию .
en: The first field pressing enables to sort in ascending order , the second pressing enables to sort in descending order .

source: При первом открытии мастера настройки список выражений содержит один элемент с именем Expr0 вещественного типа.
en: When you first open the wizard, the list of expressions contains one real item with Expr0 name.

source: При первоначальной настройке достаточно добавить входные порты и сохранить настройки компонента.
en: It is sufficient to add input ports and save the component settings for initial setup.

source: При первоначальном открытии мастера поля с одинаковым именем и типом данных сопоставляются автоматически.
en: When the wizard is initially opened, the fields with the same name and data type are automatically mapped.

source: При первоначальном создании узел не имеет портов.
en: Being originally created, the node does not have ports.

source: При перенастройке или переобучении столбца будет пересчитана только статистика, а разбиение на конечные классы останется прежним для всех столбцов.
en: When reconfiguring or retraining the column, only statistics will be recalculated, and the coarse classes binning will be the same for all columns.

source: При переопределении свойств и настроек производных узлов базовый узел остается неизменным.
en: The base node is unchanged in the case of overdetermination of properties and settings of the derived nodes.

source: При подсчете не учитываются записи с пустым значением, со значением <null> или значением не соответствующим типу данных.
en: The records with the null value, with <null> value or the value that does not match the data type are not taken into account in the calculation process.

source: При поиске ассоциативных правил применяется алгоритм FP-Growth.
en: The FP-Growth algorithm is used when searching for association rules.

source: При поиске среди вещественных и целых данных возможно указание допустимого интервала поиска.
en: It is possible to specify the allowable search interval when searching for real and integer data.

source: При полном соединении ( CROSS JOIN) производится перекрестное соединение (или декартово произведение) — каждая строка одной таблицы соединяется с каждой строкой второй таблицы, давая тем самым в результате все возможные сочетания строк двух таблиц.
en: When the join is full ( CROSS JOIN), the cross join (or Cartesian product) is performed. Each row of one table is joined with each row of the second table providing all possible combinations of rows of two tables.

source: При полном соединении (FULL JOIN) производится полное внешнее соединение двух наборов.
en: When the join is full (FULL JOIN), the full external join of two data sets is performed.

source: При помощи инструментов Производный компонент, Выполнение узла, Публикация веб-сервисов, Пакетное выполнение сценариев созданную в Подмодели логику обработки можно применять многократно для различных данных.
en: Using the following tools: the Derived component, Node execution, Publication of web services, Batch processing of the workflows, it is possible to use the processing logics created in the Supernode many times for different data.

source: При помощи поля фильтр Фильтрация можно уменьшить видимую часть списка.
en: Using thefilter Filter field, it is possible to decrease the visible part of the list.

source: При помощи радиокнопки необходимо выбрать узел сценария, который планируется повторно использовать для обработки новых данных.
en: The radio button enables to select the workflow node that is planned to be repeatedly used for processing of the new data.

source: При попытке первоначального выполнения некоторых узлов без предварительного обучения выдается предупреждение: "Модель не построена.
en: While attempting to execute some nodes initially without preliminary training, the following warning appears: "Model is not trained.

source: При последовательном нажатии будут применены варианты: по возрастанию, по убыванию, без сортировки.
en: The following options will be applied after repeated pressing: in ascending order, in descending order, without sorting.

source: При правом соединении (SQL-аналог: RIGHT JOIN, правой таблицей является присоединяемая таблица) главная и присоединяемая таблицы связываются по ключевым полям.
en: When the join is right (SQL analogue: RIGHT JOIN, the joined table is right) the main and joined tables are joined by the key fields.

source: При превышении данного размера, файл сохраняется с расширением .1 и создается новый.
en: When this size is exceeded, the file is saved with .1 extension, and the new one is created.

source: При превышении размера файла и создании нового файла логирования, старый файл получает расширение .1, со сдвигом старых сохраненных файлов на +1: .2, .3, ..., .<максимальный индекс>, старый резервный файл app.log.1 станет app.log.2, а если на момент добавления резервного файла уже был достигнут лимит, то самый старый файл лога удаляется.
en: When the file size is exceeded, and the new logging file is created, the old file gets .1 extension with +1: .2, .3, ... shift of the old saved files, .<maximum index>, the old backup app.log.1 file will become app.log.2, and the oldest log file is deleted if the limit is reached at the moment of the backup file addition.

source: При преобразовании в тип данных Дата/Время Дата/Время для ряда форматов имеется возможность выбрать начало и/или конец периода.
en: When transforming to Date/Time Date/Time data type, it is possible to select the period start and/or end for some formats.

source: При проектировании Сценария есть возможность сделать так, чтобы наши объекты (например, узлы) были доступны другому Сценарию (см.
en: When designing the Workflow, it is possible to make our objects (for example, nodes) available to another Workflow (refer to

source: При проставленном в чекбоксе флажке поле сортируется с учетом регистра.
en: When the checkbox is selected, the case-sensitive field is sorted.

source: При публикации такого узла поля/переменные в портах не будут заданы, соответственно структуры запроса/ответа сервиса не будут определены.
en: When publishing such node, the fields/variables in the ports will not be set, correspondingly, structures of the service request/response will not be defined.

source: При пустой строке в поле происходит подключение к localhost.
en: When the string is empty, connection to localhost is provided in the field.

source: При работе с диаграммой предусмотрена возможность увеличения масштаба просмотра всей диаграммы или ее произвольной области.
en: When using the chart, it is possible to zoom in the view of the whole chart or its random part.

source: При работе с кросс-таблицей может возникнуть ситуация, когда в полях, по которым были сформированы колонки, появляются новые значения.
en: When using the cross table, new values can appear in the fields by which the columns were generated.

source: При работе с сервером Loginom каждый из пользователей имеет личную папку в файловом хранилище.
en: When using the Loginom server, each user has his own folder in the file storage.

source: При работе с хранилищем от пользователя не требуется знания структуры хранения данных и языка запросов.
en: When using the data warehouse, it is not obligatory for a user to know the data storage structure and data query language.

source: При редактировании отчетов меняется так же исходный визуализатор, на основании которого построен отчет.
en: When editing reports, the source visualizer used to make the report is also changed.

source: При редактировании содержимого Подмодели ее входные и выходные порты, созданные в мастере настройки, отображаются по левому и правому краю области над кнопками Выходной узел Входной узел и Выходной узел Выходной узел.
en: When editing the Supernode content, its input and output ports created in the wizard are displayed in the left and right parts of the area over the following buttons: Output node Input node and Output node Output node.

source: При ручном формировании структуры набора, который впоследствии будет подан на обаботку, используются команды панели инструментов или контекстного меню.
en: In the case of the manual structuring of the data set to be subsequently supplied for processing, the context menu or toolbar commands will be used.

source: При снятии выделения с ветки выделение снимается и со всех потомков.
en: When branch deselecting, all its descendants are deselected.

source: При создании Узел-ссылка не имеет портов.
en: When creating, the Reference node does not have ports.

source: При создании нескольких условий между ними необходимо задать логические операторы И/ИЛИ.
en: When creating several criteria, it is required to set the logical AND/OR operators between them.

source: При создании нескольких условий, между ними необходимо задать логические операторы И/ИЛИ.
en: When creating several criteria, it is required to set the logical AND/OR operators between them.

source: При создании переменной следует задать:
en: When creating the variable, it is required to set the following information:

source: При создании таблицы:
en: When creating the table, the following criteria are met:

source: При создании узел не имеет портов.
en: When creating, the node does not have ports.

source: При сортировке учитывается:
en: The following parameters are taken into account while sorting:

source: При таком соединении необходимо сопоставление ключевых полей.
en: Mapping of the key fields is required for such join.

source: При таком соединении порядок таблиц (левая, правая) неважен и отсутствует необходимость в сопоставлении ключевых полей.
en: In the case of such join, the order of tables (left, right) is not important, and it is not required to map the key fields.

source: При увеличении диаграммы во всю область визуализатора, появляется выпадающий список, в нем можно выбрать поле, для которого будет построена диаграмма (см.
en: When expanding the chart over the whole visualizer area, the drop-down list appears. It enables to select the field for which the chart will be generated (refer to

source: При успешном завершении активации открывается данное окно.
en: This window is opened when the activation is successfully finished.

source: При успешном завершении активации открывается окно Предпросмотра.
en: The Preview window is opened if the activation has been successfully finished.

source: При установке по умолчанию утилита располагается по пути:
en: When installing by default, the utility application path is as follows:
